In [2]:
import numpy as np

In [3]:
import pandas as pd

In [17]:
archivotemp =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\2017PurchasePricesDec.csv"

df_PurchasePriceDesc= pd.read_csv(archivotemp)

In [18]:
archivotemp4 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\InvoicePurchases12312016.csv"

df_InvoicePurchases= pd.read_csv(archivotemp4)

In [19]:
archivotemp5 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\PurchasesFINAL12312016.csv"

df_PurchasesFINAL= pd.read_csv(archivotemp5)

In [301]:
archivotemp6 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\SalesFINAL12312016.csv"

df_SalesFINAL= pd.read_csv(archivotemp6)

In [21]:
archivotemp2 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\BegInvFINAL12312016.csv"

df_BegInv= pd.read_csv(archivotemp2)

In [22]:
archivotemp3 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\EndInvFINAL12312016.csv"

df_EndInv= pd.read_csv(archivotemp3)

###  Creacion Tabla de Proveedores "Vendors"

In [9]:
df_SalesFINALVendors = df_SalesFINAL[['VendorNo','VendorName']]
df_InvoicePurchasesVendors = df_InvoicePurchases[['VendorNumber','VendorName']] ## tiene vendor no
df_PurchasePriceDescVendors = df_PurchasePriceDesc[['VendorNumber','VendorName']] ## tiene vendor number
df_PurchasesFINALVendors = df_PurchasesFINAL[['VendorNumber','VendorName']] ## tiene vendor number

In [12]:
df_SalesFINALVendors.rename (columns={'VendorNo': 'VendorNumber'}, inplace=True)
print(df_SalesFINALVendors.head(5))

   VendorNumber                   VendorName
0         12546  JIM BEAM BRANDS COMPANY
1         12546  JIM BEAM BRANDS COMPANY
2         12546  JIM BEAM BRANDS COMPANY
3         12546  JIM BEAM BRANDS COMPANY
4         12546  JIM BEAM BRANDS COMPANY

C:\Users\PC\AppData\Local\Temp\ipykernel_14000\1608614556.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_SalesFINALVendors.rename (columns={'VendorNo': 'VendorNumber'}, inplace=True)

In [24]:
Vendors = pd.concat([df_SalesFINALVendors, df_InvoicePurchasesVendors,df_PurchasesFINALVendors,df_PurchasePriceDescVendors])
print(Vendors)

       VendorNumber                   VendorName
0             12546  JIM BEAM BRANDS COMPANY
1             12546  JIM BEAM BRANDS COMPANY
2             12546  JIM BEAM BRANDS COMPANY
3             12546  JIM BEAM BRANDS COMPANY
4             12546  JIM BEAM BRANDS COMPANY
...             ...                          ...
12256         90024  VINILANDIA USA
12257          4425        MARTIGNETTI COMPANIES
12258         10754  PERFECTA WINES
12259          9744  FREDERICK WILDMAN & SONS
12260         10754  PERFECTA WINES

[3438853 rows x 2 columns]

In [30]:
duplicados = Vendors[Vendors.duplicated()]
print(duplicados)
duplicados.shape

       VendorNumber                   VendorName
1             12546  JIM BEAM BRANDS COMPANY
2             12546  JIM BEAM BRANDS COMPANY
3             12546  JIM BEAM BRANDS COMPANY
4             12546  JIM BEAM BRANDS COMPANY
5             12546  JIM BEAM BRANDS COMPANY
...             ...                          ...
12256         90024  VINILANDIA USA
12257          4425        MARTIGNETTI COMPANIES
12258         10754  PERFECTA WINES
12259          9744  FREDERICK WILDMAN & SONS
12260         10754  PERFECTA WINES

[3438716 rows x 2 columns]

(3438716, 2)

In [27]:
Vendors.duplicated().count()

np.int64(3438853)

In [32]:
conteo = Vendors.value_counts()
print("Conteo de duplicados:")
print(conteo)

Conteo de duplicados:
VendorNumber  VendorName
3960          DIAGEO NORTH AMERICA INC               369699
12546         JIM BEAM BRANDS COMPANY                284359
1392          CONSTELLATION BRANDS INC               256902
4425          MARTIGNETTI COMPANIES                  254424
3252          E & J GALLO WINERY                     228389
                                                      ...
2973          FLEMISH LION LLC                            1
5895          Mizkan Americas, Inc.                       1
3670          HALO DISTILLERY                             1
1703          ALISA CARR BEVERAGES                        1
90034         EXCLUSIVE WINES & SPIRITS                   1
Name: count, Length: 137, dtype: int64

In [41]:
Vendors = Vendors.drop_duplicates(subset='VendorNumber')
print(Vendors)

      VendorNumber                   VendorName
0            12546  JIM BEAM BRANDS COMPANY
8             2000  SOUTHERN WINE & SPIRITS NE
18           10754  PERFECTA WINES
31            8352  LUXCO INC
33           17035  PERNOD RICARD USA
...            ...                          ...
5015            54  AAPER ALCOHOL & CHEMICAL CO
542           5895  Mizkan Americas, Inc.
5018          3670  HALO DISTILLERY
7630          2973  FLEMISH LION LLC
7640         90034  EXCLUSIVE WINES & SPIRITS

[132 rows x 2 columns]

In [42]:
Vendors.value_counts()

VendorNumber  VendorName
2             IRA GOLDMAN AND WILLIAMS, LLP              1
54            AAPER ALCOHOL & CHEMICAL CO                1
60            ADAMBA IMPORTS INTL INC                    1
105           ALTAMAR BRANDS LLC                         1
200           AMERICAN SPIRITS EXCHANGE                  1
                                                        ..
98450         Serralles Usa LLC                          1
99166         STARK BREWING COMPANY                      1
172662        SWEETWATER FARM                            1
173357        TAMWORTH DISTILLING                        1
201359        FLAVOR ESSENCE INC                         1
Name: count, Length: 132, dtype: int64

In [43]:
for vendor, count in Vendors.value_counts().items():  # Iterar sobre el conteo de valores
    if count > 1:  # Verificar si el conteo es mayor a 1
        print(vendor)

In [44]:
Vendors.isnull().sum()

VendorNumber    0
VendorName      0
dtype: int64

In [45]:
Vendorsnull = Vendors[Vendors.isnull().any(axis=1)]
print(Vendorsnull)
Vendorsnull.shape

Empty DataFrame
Columns: [VendorNumber, VendorName]
Index: []

(0, 2)

In [46]:
Vendors[Vendors['VendorNumber'] == 1587]

      VendorNumber                   VendorName
1009          1587  VINEYARD BRANDS INC

In [19]:
type_mapping = {
    'int64': 'INT',
    'float64': 'FLOAT',
    'object': 'NVARCHAR(250)',
    'datetime64[ns]': 'DATETIME',
    'bool': 'BIT'
}

In [20]:
for col in Vendors.columns:
    sql_type = type_mapping[str(Vendors[col].dtype)]
    print(sql_type)

INT
NVARCHAR(250)

In [21]:

# Crear la instrucción CREATE TABLE
table_name = "Vendors"
create_table_sql = f"CREATE TABLE {table_name} (\n"

for col in Vendors.columns:
    sql_type = type_mapping[str(Vendors[col].dtype)]
    create_table_sql += f"    {col} {sql_type},\n"

create_table_sql = create_table_sql.rstrip(",\n") + "\n);"

# Mostrar el script SQL
print(create_table_sql)

CREATE TABLE Vendors (
    VendorNumber INT,
    VendorName NVARCHAR(250)
);

In [47]:
Vendors.to_csv('Vendor.csv', index=False)

### Creacióm Tabla de Brands

In [48]:
df_PurchasePriceDesc

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber,VendorName
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320,SHAW ROSS INT L IMP LTD
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128,BROWN-FORMAN CORP
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128,BROWN-FORMAN CORP
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165,ULTRA BEVERAGE COMPANY LLP
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245,PROXIMO SPIRITS INC.
...,...,...,...,...,...,...,...,...,...
12256,44917,Ferreira 10-Yr Tawny Port,24.99,750mL,750,2,16.55,90024,VINILANDIA USA
12257,44944,Sanford Santa Rita Pnt Nr,22.99,750mL,750,2,14.93,4425,MARTIGNETTI COMPANIES
12258,45016,Neal One Lane Bridg Cab Svgn,93.99,750mL,750,2,61.43,10754,PERFECTA WINES
12259,46011,Folonari Pnt Nr Venezie,12.99,1500ml,1500,2,8.90,9744,FREDERICK WILDMAN & SONS
12260,46964,Calera Viognier Mt Harlan,35.99,750mL,750,2,24.32,10754,PERFECTA WINES

In [49]:
df_PurchasePriceDesc.dtypes

Brand               int64
Description        object
Price             float64
Size               object
Volume             object
Classification      int64
PurchasePrice     float64
VendorNumber        int64
VendorName         object
dtype: object

In [51]:
for col in df_PurchasePriceDesc.columns:
    sql_type = type_mapping[str(df_PurchasePriceDesc[col].dtype)]
    print(f'{col} :{sql_type}')

Brand :INT
Description :NVARCHAR(250)
Price :FLOAT
Size :NVARCHAR(250)
Volume :NVARCHAR(250)
Classification :INT
PurchasePrice :FLOAT
VendorNumber :INT
VendorName :NVARCHAR(250)

In [138]:
Brands = df_PurchasePriceDesc[['Brand', 'Description', 'Price', 'Size', 'Volume', 'Classification',
       'PurchasePrice', 'VendorNumber']]

In [139]:
Brands.head(5)

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245

In [140]:
Brands[Brands.isnull().any(axis =1)]

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber
7915,4202,NaN,0.0,NaN,NaN,1,11.19,480

In [141]:
df_SalesFINAL[df_SalesFINAL['Brand']== 4202]

Empty DataFrame
Columns: [InventoryId, Store, Brand, Description, Size, SalesQuantity, SalesDollars, SalesPrice, SalesDate, Volume, Classification, ExciseTax, VendorNo, VendorName]
Index: []

In [104]:
df_PurchasesFINAL[df_PurchasesFINAL['Brand']== 4202]

Empty DataFrame
Columns: [InventoryId, Store, Brand, Description, Size, VendorNumber, VendorName, PONumber, PODate, ReceivingDate, InvoiceDate, PayDate, PurchasePrice, Quantity, Dollars, Classification]
Index: []

In [142]:
Brands = Brands[Brands['Brand'] != 4202]

In [152]:
Brands[Brands.isnull().any(axis =1)]

Empty DataFrame
Columns: [Brand, Description, Price, Size, Volume, Classification, PurchasePrice, VendorNumber]
Index: []

In [153]:
Brands.shape

(12260, 8)

In [120]:
Brands.dtypes

Brand               int64
Description        object
Price             float64
Size               object
Volume             object
Classification      int64
PurchasePrice     float64
VendorNumber        int64
dtype: object

Hay 5 registros que figuran en Size y Volume como Unknown. Corregirlos con la descripción. NO fueron cargados en el SQL.
2993	
9908
8992
90590

In [151]:
Brands[Brands['Brand']== 2993]

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber
542,2993,Angostura Bitters,7.49,0,0,1,5.39,5895

In [149]:
Brands[Brands['Size']=='Unknown']

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber
542,2993,Angostura Bitters,7.49,Unknown,0,1,5.39,5895
5921,9908,Tito's Copper Mug 2 Pack,21.01,Unknown,0,1,16.15,4425
8795,8992,Group 92,1.99,Unknown,0,1,1.43,1703
10009,90590,Overture Champagne 2Glass Pk,19.95,Unknown,0,2,13.12,4425

In [147]:
Brands.loc[Brands['Volume']=='Unknown', 'Volume'] = 0

In [150]:
Brands.loc[Brands['Size']=='Unknown', 'Size'] = 0

In [130]:
Brands.head(5)

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245

In [155]:
Brands.to_csv('Brands.csv', index=False)

### Creacion Tabla de Inventario

In [176]:
for col in df_BegInv.columns:
    sql_type = type_mapping[str(df_BegInv[col].dtype)]
    print(f'{col} :{sql_type}')

InventoryId :NVARCHAR(250)
Store :INT
City :NVARCHAR(250)
Brand :INT
Description :NVARCHAR(250)
Size :NVARCHAR(250)
onHand :INT
Price :FLOAT
Date :NVARCHAR(250)

In [175]:
df_EndInv[df_EndInv.isnull().any(axis=1)]

Empty DataFrame
Columns: [InventoryId, Store, City, Brand, Description, Size, onHand, Price, Date]
Index: []

In [174]:
df_BegInv[df_BegInv.isnull().any(axis=1)]

Empty DataFrame
Columns: [InventoryId, Store, City, Brand, Description, Size, onHand, Price, Date]
Index: []

In [170]:
df_EndInv.loc[df_EndInv['Store'] == 46]

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,Date
113895,46__58,46,TYWARDREATH,58,Gekkeikan Black & Gold Sake,750mL,0,12.99,2016-12-31
113896,46__62,46,TYWARDREATH,62,Herradura Silver Tequila,750mL,0,36.99,2016-12-31
113897,46__63,46,TYWARDREATH,63,Herradura Reposado Tequila,750mL,0,38.99,2016-12-31
113898,46__77,46,TYWARDREATH,77,Three Olives Espresso Vodka,750mL,0,14.99,2016-12-31
113899,46__106,46,TYWARDREATH,106,Mr Boston Peach Schnapps,Liter,0,4.49,2016-12-31
...,...,...,...,...,...,...,...,...,...
115174,46__46447,46,TYWARDREATH,46447,Gascon Malbec Mendoza,750mL,0,10.99,2016-12-31
115175,46__46458,46,TYWARDREATH,46458,Layer Cake Barosa Shiraz,750mL,0,15.99,2016-12-31
115176,46__46476,46,TYWARDREATH,46476,Tilia Malbec Mendoza,750mL,0,9.99,2016-12-31
115177,46__46764,46,TYWARDREATH,46764,Clayhouse Adobe Red Paso Rbl,750mL,0,11.99,2016-12-31
115178,46__46830,46,TYWARDREATH,46830,Pacific Rim Sweet Rsl,750mL,0,8.99,2016-12-31

In [162]:
df_EndInv.loc[df_EndInv['Store'] == 46, 'City'] = 'TYWARDREATH'

In [165]:
df_BegInv.loc[df_BegInv['Store'] == 46, 'City'] = 'TYWARDREATH'

Cambio el nombre de la columnas de date para luego unir las bases

In [167]:
df_EndInv = df_EndInv.rename(columns={'endDate': 'Date'})

In [173]:
df_BegInv = df_BegInv.rename(columns={'startDate': 'Date'})

Cambio el tipo de dato a datetime

In [177]:
df_BegInv['Date'] = pd.to_datetime(df_BegInv['Date'], errors='coerce')

In [182]:
df_EndInv['Date'] = pd.to_datetime(df_EndInv['Date'], errors='coerce')

In [181]:
print(df_BegInv['Date'].dtype)

datetime64[ns]

voy a unir las tablas de Sales, Purchases e Inventories para tener todos los InventarioID, ya que hay iD en sales que no estan en una o la otra, y no se pueden crear las claves foragneas

In [298]:
InventoriesIDs = df_EndInv['InventoryId']

In [299]:
InventoriesIDs = pd.concat([InventoriesIDs,df_BegInv['InventoryId']],ignore_index= True)

In [302]:
InventoriesIDs = pd.concat([InventoriesIDs,df_SalesFINAL['InventoryId']],ignore_index= True)

In [303]:
InventoriesIDs = pd.concat([InventoriesIDs,df_PurchasesFINAL['InventoryId']],ignore_index= True)

In [304]:
InventoriesIDs.head(5)

0    1_HARDERSFIELD_58
1    1_HARDERSFIELD_62
2    1_HARDERSFIELD_63
3    1_HARDERSFIELD_72
4    1_HARDERSFIELD_75
Name: InventoryId, dtype: object

In [305]:
InventoriesIDs.drop_duplicates()

0             1_HARDERSFIELD_58
1             1_HARDERSFIELD_62
2             1_HARDERSFIELD_63
3             1_HARDERSFIELD_72
4             1_HARDERSFIELD_75
                   ...
3846941          3_HORNSEY_5962
3848205      13_TARMSWORTH_2901
3848844    47_PELLA'S WISH_5836
3850555      55_DRY GULCH_11150
3851483      55_DRY GULCH_13725
Name: InventoryId, Length: 276389, dtype: object

In [306]:
InventoriesInitial = df_BegInv[['InventoryId', 'Brand','onHand', 'Store', 'Date']]

In [307]:
InventoriesFinal = df_EndInv[['InventoryId', 'Brand','onHand', 'Store', 'Date']]

In [308]:
InventoriesTotal = pd.merge(InventoriesIDs,InventoriesInitial, how= 'left', on = 'InventoryId')

In [309]:
InventoriesTotal.head(5)

         InventoryId  Brand  onHand  Store       Date
0  1_HARDERSFIELD_58   58.0     8.0    1.0 2016-01-01
1  1_HARDERSFIELD_62   62.0     6.0    1.0 2016-01-01
2  1_HARDERSFIELD_63   63.0     3.0    1.0 2016-01-01
3  1_HARDERSFIELD_72   72.0     6.0    1.0 2016-01-01
4  1_HARDERSFIELD_75   75.0    18.0    1.0 2016-01-01

In [331]:
InventoriesTotal = InventoriesTotal[['InventoryId','Brand','Store']]

In [311]:
InventoriesTotal.shape

(3852067, 3)

In [338]:
InventoriesTotal.isnull().sum()

InventoryId    0
Brand          0
Store          0
dtype: int64

In [281]:
InventoriesInitial.isnull().sum()

InventoryId    0
Brand          0
onHand         0
Store          0
Date           0
dtype: int64

In [282]:
InventoriesFinal.isnull().sum()

InventoryId    0
Brand          0
onHand         0
Store          0
Date           0
dtype: int64

In [339]:
Nulos = InventoriesTotal[InventoriesTotal.isnull().any(axis=1)]
print(Nulos)

Empty DataFrame
Columns: [InventoryId, Brand, Store]
Index: []

quiero rellenar los nulos con los valores que encuentre en InventoriesFinal

In [314]:
# Primero, establece 'InventoryID' como el índice en ambos DataFrames
InventoriesTotal.set_index('InventoryId', inplace=True)
InventoriesFinal.set_index('InventoryId', inplace=True)

# Utiliza el método combine_first para rellenar los valores nulos
InventoriesTotal = InventoriesTotal.combine_first(InventoriesFinal).reset_index()

aun quedan nulos, ver de que tablas salieron que no estan ni en inventario Inicial, ni en Inevntario Final

In [315]:
Nulos = pd.merge(Nulos,df_SalesFINAL,on='InventoryId', how= 'left')
print(Nulos)

                InventoryId  Brand_x  Store_x  Store_y  Brand_y  \
0        1_HARDERSFIELD_159      NaN      NaN      NaN      NaN
1        1_HARDERSFIELD_200      NaN      NaN      1.0    200.0
2        1_HARDERSFIELD_200      NaN      NaN      1.0    200.0
3        1_HARDERSFIELD_271      NaN      NaN      NaN      NaN
4        1_HARDERSFIELD_288      NaN      NaN      NaN      NaN
...                     ...      ...      ...      ...      ...
390601  62_KILMARNOCK_24303      NaN      NaN      NaN      NaN
390602    41_LARNWICK_18010      NaN      NaN      NaN      NaN
390603  62_KILMARNOCK_24953      NaN      NaN      NaN      NaN
390604    81_PEMBROKE_19557      NaN      NaN      NaN      NaN
390605   50_MOUNTMEND_25126      NaN      NaN      NaN      NaN

                       Description   Size  SalesQuantity  SalesDollars  \
0                              NaN    NaN            NaN           NaN
1       Luxardo Maraschino Liqueur  750mL            1.0         29.99
2       Luxardo Maraschino Liqueur  750mL            1.0         29.99
3                              NaN    NaN            NaN           NaN
4                              NaN    NaN            NaN           NaN
...                            ...    ...            ...           ...
390601                         NaN    NaN            NaN           NaN
390602                         NaN    NaN            NaN           NaN
390603                         NaN    NaN            NaN           NaN
390604                         NaN    NaN            NaN           NaN
390605                         NaN    NaN            NaN           NaN

        SalesPrice  SalesDate  Volume  Classification  ExciseTax  VendorNo  \
0              NaN        NaN     NaN             NaN        NaN       NaN
1            29.99  1/13/2016   750.0             1.0       0.79    9165.0
2            29.99  2/23/2016   750.0             1.0       0.79    9165.0
3              NaN        NaN     NaN             NaN        NaN       NaN
4              NaN        NaN     NaN             NaN        NaN       NaN
...            ...        ...     ...             ...        ...       ...
390601         NaN        NaN     NaN             NaN        NaN       NaN
390602         NaN        NaN     NaN             NaN        NaN       NaN
390603         NaN        NaN     NaN             NaN        NaN       NaN
390604         NaN        NaN     NaN             NaN        NaN       NaN
390605         NaN        NaN     NaN             NaN        NaN       NaN

                         VendorName
0                               NaN
1       ULTRA BEVERAGE COMPANY LLP
2       ULTRA BEVERAGE COMPANY LLP
3                               NaN
4                               NaN
...                             ...
390601                          NaN
390602                          NaN
390603                          NaN
390604                          NaN
390605                          NaN

[390606 rows x 16 columns]

In [325]:
InventoriesTotal.set_index('InventoryId', inplace=True)

In [326]:
Sales_inv = df_SalesFINAL[['Brand','InventoryId','Store']].drop_duplicates()

In [327]:
Sales_inv.set_index('InventoryId', inplace=True)

In [328]:

# Utiliza el método combine_first para rellenar los valores nulos
InventoriesTotal = InventoriesTotal.combine_first(Sales_inv)

In [330]:
InventoriesTotal.reset_index(inplace=True)
Sales_inv.reset_index(inplace=True)

Hacer lo mismo con purchases. deberian desaparecer lso nulos

In [333]:
InventoriesTotal.set_index('InventoryId', inplace=True)

In [334]:
Purchases_inv = df_PurchasesFINAL[['Brand','InventoryId','Store']].drop_duplicates()

In [335]:
Purchases_inv.set_index('InventoryId', inplace=True)

In [336]:
InventoriesTotal = InventoriesTotal.combine_first(Purchases_inv)

In [337]:
InventoriesTotal.reset_index(inplace=True)
Purchases_inv.reset_index(inplace=True)

In [343]:
InventoriesTotal.dtypes

InventoryId     object
Brand          float64
Store          float64
dtype: object

In [354]:
InventoriesTotal.shape[0]

276389

In [355]:
InventoriesTotal.nunique()

InventoryId    276389
Brand           11503
Store              80
dtype: int64

In [350]:
InventoriesTotal[InventoriesTotal.duplicated()]

             InventoryId   Brand  Store
1        10_HORNSEY_1000  1000.0   10.0
3        10_HORNSEY_1001  1001.0   10.0
4        10_HORNSEY_1001  1001.0   10.0
5        10_HORNSEY_1001  1001.0   10.0
6        10_HORNSEY_1001  1001.0   10.0
...                  ...     ...    ...
3852061  9_BLACKPOOL_984   984.0    9.0
3852062  9_BLACKPOOL_984   984.0    9.0
3852063  9_BLACKPOOL_984   984.0    9.0
3852064  9_BLACKPOOL_984   984.0    9.0
3852066  9_BLACKPOOL_999   999.0    9.0

[3575678 rows x 3 columns]

In [353]:
InventoriesTotal = InventoriesTotal.drop_duplicates()

In [348]:
repe =InventoriesTotal[InventoriesTotal['InventoryId']=='1_HARDERSFIELD_1001']
print (repe)

                InventoryId   Brand  Store
484352  1_HARDERSFIELD_1001  1001.0    1.0
484353  1_HARDERSFIELD_1001  1001.0    1.0
484354  1_HARDERSFIELD_1001  1001.0    1.0
484355  1_HARDERSFIELD_1001  1001.0    1.0

Llevar archivos a .csv

In [345]:
InventoriesTotal.to_csv('InventoriesTotal.csv', index = False)

In [ ]:
InventoriesInitial.to_csv('InventoriesInitial.csv', index= False)

In [200]:
InventoriesFinal.to_csv('InventoriesFinal.csv', index= False)

In [183]:
Inventories = pd.concat([df_EndInv, df_BegInv], ignore_index=True)

In [185]:
print(df_BegInv.shape)

(206529, 9)

In [187]:
print(df_EndInv.shape)

(224489, 9)

In [184]:
print(Inventories.shape)

(431018, 9)

In [189]:
Inventories.columns

Index(['InventoryId', 'Store', 'City', 'Brand', 'Description', 'Size',
       'onHand', 'Price', 'Date'],
      dtype='object')

In [191]:
Inventories = Inventories[['InventoryId', 'Brand','onHand', 'Store', 'Date']]

In [192]:
Inventories.to_csv('Inventories.csv', index= False)

In [193]:
duplicadosInv = Inventories[Inventories.duplicated()]
print(duplicadosInv)
duplicadosInv.shape

Empty DataFrame
Columns: [InventoryId, Brand, onHand, Store, Date]
Index: []

(0, 5)

In [194]:
print(Inventories[Inventories['InventoryId']== '1_HARDERSFIELD_1001'])

                InventoryId  Brand  onHand  Store       Date
113     1_HARDERSFIELD_1001   1001       0      1 2016-12-31
224605  1_HARDERSFIELD_1001   1001       0      1 2016-01-01

### Creacion Tabla PurchaseInvoices

In [9]:
type_mapping = {
    'int64': 'INT',
    'float64': 'FLOAT',
    'object': 'NVARCHAR(250)',
    'datetime64[ns]': 'DATETIME',
    'bool': 'BIT'
}

In [12]:
for col in df_InvoicePurchases.columns:
    sql_type = type_mapping[str(df_InvoicePurchases[col].dtype)]
    print(f'{col}:{sql_type}')

VendorNumber:INT
VendorName:NVARCHAR(250)
InvoiceDate:NVARCHAR(250)
PONumber:INT
PODate:NVARCHAR(250)
PayDate:NVARCHAR(250)
Quantity:INT
Dollars:FLOAT
Freight:FLOAT
Approval:NVARCHAR(250)

transformar las 'dates' a formato DATETIME

In [202]:

df_InvoicePurchases['InvoiceDate'] = pd.to_datetime(df_InvoicePurchases['InvoiceDate'], errors='coerce')
df_InvoicePurchases['PODate'] = pd.to_datetime(df_InvoicePurchases['PODate'])
df_InvoicePurchases['PayDate'] = pd.to_datetime(df_InvoicePurchases['PayDate'])

In [203]:
df_InvoicePurchases.columns

Index(['VendorNumber', 'VendorName', 'InvoiceDate', 'PONumber', 'PODate',
       'PayDate', 'Quantity', 'Dollars', 'Freight', 'Approval'],
      dtype='object')

In [204]:
df_InvoicePurchases = df_InvoicePurchases[['VendorNumber', 'InvoiceDate', 'PONumber', 'PODate',
       'PayDate', 'Quantity', 'Dollars', 'Freight', 'Approval']]

In [205]:
df_InvoicePurchases.to_csv('InvoicePurchases.csv', index= False)

### Creacion Tabla InvoicePurchasesDetails

In [13]:
archivotemp5 =  r"C:\Data Anaytics\Proyectos\Inventario\Base de datos\PurchasesFINAL12312016.csv"

df_PurchasesFINAL= pd.read_csv(archivotemp5)

In [14]:
for col in df_PurchasesFINAL.columns:
    sql_type = type_mapping[str(df_PurchasesFINAL[col].dtype)]
    print(f'{col}:{sql_type}')

InventoryId:NVARCHAR(250)
Store:INT
Brand:INT
Description:NVARCHAR(250)
Size:NVARCHAR(250)
VendorNumber:INT
VendorName:NVARCHAR(250)
PONumber:INT
PODate:NVARCHAR(250)
ReceivingDate:NVARCHAR(250)
InvoiceDate:NVARCHAR(250)
PayDate:NVARCHAR(250)
PurchasePrice:FLOAT
Quantity:INT
Dollars:FLOAT
Classification:INT

In [206]:
df_PurchasesFINAL.columns

Index(['InventoryId', 'Store', 'Brand', 'Description', 'Size', 'VendorNumber',
       'VendorName', 'PONumber', 'PODate', 'ReceivingDate', 'InvoiceDate',
       'PayDate', 'PurchasePrice', 'Quantity', 'Dollars', 'Classification'],
      dtype='object')

In [207]:
InvoicePurchasesDetails = df_PurchasesFINAL[['Brand', 'Dollars', 'InventoryId','PONumber','PurchasePrice','Quantity','ReceivingDate','Store','VendorNumber']]

In [209]:
InvoicePurchasesDetails['ReceivingDate'] = pd.to_datetime(InvoicePurchasesDetails['ReceivingDate'])

C:\Users\PC\AppData\Local\Temp\ipykernel_26776\3751078844.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  InvoicePurchasesDetails['ReceivingDate'] = pd.to_datetime(InvoicePurchasesDetails['ReceivingDate'])

In [210]:
InvoicePurchasesDetails.head(2)

,Brand,Dollars,InventoryId,PONumber,PurchasePrice,Quantity,ReceivingDate,Store,VendorNumber
0,8412,214.26,69_MOUNTMEND_8412,8124,35.71,6,2016-01-02,69,105
1,5255,37.40,30_CULCHETH_5255,8137,9.35,4,2016-01-01,30,4466

In [211]:
InvoicePurchasesDetails.to_csv('InvoicePurchasesDetails.csv', index= False)

### Creacion Tabla Sales

In [23]:
for col in df_SalesFINAL.columns:
    sql_type = type_mapping[str(df_SalesFINAL[col].dtype)]
    print(f'{col}:{sql_type}')

InventoryId:NVARCHAR(250)
Store:INT
Brand:INT
Description:NVARCHAR(250)
Size:NVARCHAR(250)
SalesQuantity:INT
SalesDollars:FLOAT
SalesPrice:FLOAT
SalesDate:NVARCHAR(250)
Volume:INT
Classification:INT
ExciseTax:FLOAT
VendorNo:INT
VendorName:NVARCHAR(250)

In [217]:
Sales = df_SalesFINAL[['Brand','ExciseTax', 'InventoryId','SalesDate','SalesDollars','SalesPrice','SalesQuantity','Store','VendorNo','Volume']]

In [219]:
Sales= Sales.rename(columns={'VendorNo' : 'VendorNumber'})

In [220]:
Sales['SalesDate']= pd.to_datetime(Sales['SalesDate'],errors = 'coerce')

In [221]:
Sales.to_csv('Sales.csv', index=False)

### Creación Tabla Stores

Union de todas las tablas que tiene el campo STore para asegurar que no me olvido ninguno y luego elimino duplicados

In [51]:
Sales_stores = df_SalesFINAL[['Store']].drop_duplicates()
Purchases_stores = df_PurchasesFINAL[['Store']].drop_duplicates()
InventaryBeg_stores = df_BegInv[['Store']].drop_duplicates()
InventaryEnd_stores = df_EndInv[['Store']].drop_duplicates()

In [52]:
df_merge_stores = pd.merge(Sales_stores,Purchases_stores,on= 'Store',how = 'outer').drop_duplicates()
df_merge_stores = pd.merge(df_merge_stores,InventaryBeg_stores,on= 'Store',how = 'outer').drop_duplicates()
df_merge_stores = pd.merge(df_merge_stores,InventaryEnd_stores,on= 'Store',how = 'outer').drop_duplicates()

In [86]:
Stores = pd.merge(df_merge_stores,df_EndInv,on = 'Store', how = 'left')

In [87]:
Stores = Stores[['Store','City']].drop_duplicates()

In [88]:
print(Stores.head(5))

      Store          City
0         1  HARDERSFIELD
3192      2      ASHBORNE
5911      3       HORNSEY
6374      4    EANVERNESS
9225      5        SUTTON

In [89]:
print(df_merge_stores.count())

Store    80
dtype: int64

In [90]:
print(Stores.shape)
print(Stores)

(80, 2)
        Store          City
0           1  HARDERSFIELD
3192        2      ASHBORNE
5911        3       HORNSEY
6374        4    EANVERNESS
9225        5        SUTTON
...       ...           ...
207602     76     DONCASTER
212722     77      TAMWORTH
215234     78     EASTHAVEN
216996     79     BALLYMENA
220900     81      PEMBROKE

[80 rows x 2 columns]

In [93]:
nulos = Stores[Stores.isnull().any(axis=1)]
print(nulos)

Empty DataFrame
Columns: [Store, City]
Index: []

In [79]:
for col in Stores.columns:
    sql_type = type_mapping[str(Stores[col].dtype)]
    print(f'{col}:{sql_type}')

Store:INT
City:NVARCHAR(250)

In [81]:
df_EndInv[df_EndInv['Store']==46]['City']

113895    NaN
113896    NaN
113897    NaN
113898    NaN
113899    NaN
         ...
115174    NaN
115175    NaN
115176    NaN
115177    NaN
115178    NaN
Name: City, Length: 1284, dtype: object

In [69]:
df_PurchasesFINAL[df_PurchasesFINAL['Store']==46]

,InventoryId,Store,Brand,Description,Size,VendorNumber,VendorName,PONumber,PODate,ReceivingDate,InvoiceDate,PayDate,PurchasePrice,Quantity,Dollars,Classification
1925,46_TYWARDREATH_8517,46,8517,Baileys Salted Caramel,750mL,3960,DIAGEO NORTH AMERICA INC,8173,2015-12-24,2016-01-03,2016-01-10,2016-02-19,13.86,1,13.86,1
9091,46_TYWARDREATH_4222,46,4222,Bacardi Gold Rum,750mL,480,BACARDI USA INC,8288,2016-01-01,2016-01-06,2016-01-19,2016-02-18,7.99,12,95.88,1
9093,46_TYWARDREATH_4233,46,4233,Castillo Silver Label Rum,1.75L,480,BACARDI USA INC,8288,2016-01-01,2016-01-06,2016-01-19,2016-02-18,7.87,30,236.10,1
9110,46_TYWARDREATH_903,46,903,Bombay Sapphire Gin,Liter,480,BACARDI USA INC,8288,2016-01-01,2016-01-06,2016-01-19,2016-02-18,18.79,3,56.37,1
9159,46_TYWARDREATH_508,46,508,Bacardi Superior Rum,Liter,480,BACARDI USA INC,8288,2016-01-01,2016-01-06,2016-01-19,2016-02-18,9.77,12,117.24,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286572,46__8323,46,8323,Jose Cuervo Gold w/Marg Mix,750mL,7245,PROXIMO SPIRITS INC.,11291,2016-07-20,2016-07-27,2016-08-07,2016-09-08,11.90,12,142.80,1
1287115,46__8166,46,8166,Mount Gay Eclipse,750mL,7239,REMY COINTREAU USA INC,11253,2016-07-18,2016-07-27,2016-08-08,2016-09-10,15.14,12,181.68,1
1290936,46__5445,46,5445,Jagermeister Liqueur,750mL,3089,SIDNEY FRANK IMPORTING CO,11306,2016-07-21,2016-07-27,2016-08-01,2016-09-09,11.76,14,164.64,1
1292763,46__3938,46,3938,Stolichnaya,750mL,8664,"STOLI GROUP,(USA) LLC",11254,2016-07-18,2016-07-27,2016-08-09,2016-09-01,12.49,24,299.76,1
1294343,46__31202,46,31202,Beringer Fndrs Est Chard,750mL,9819,TREASURY WINE ESTATES,11295,2016-07-20,2016-07-27,2016-08-02,2016-09-08,6.07,14,84.98,2

In [68]:
df_SalesFINAL[df_SalesFINAL['Store']==46]

,InventoryId,Store,Brand,Description,Size,SalesQuantity,SalesDollars,SalesPrice,SalesDate,Volume,Classification,ExciseTax,VendorNo,VendorName
411078,46_TYWARDREATH_10058,46,10058,F Coppola Dmd Ivry Cab Svgn,750mL,1,14.99,14.99,1/16/2016,750,2,0.11,2000,SOUTHERN WINE & SPIRITS NE
411079,46_TYWARDREATH_10058,46,10058,F Coppola Dmd Ivry Cab Svgn,750mL,1,14.99,14.99,1/31/2016,750,2,0.11,2000,SOUTHERN WINE & SPIRITS NE
411080,46_TYWARDREATH_10227,46,10227,Due Torri Pnt Nr del Venezie,750mL,3,29.97,9.99,1/12/2016,750,2,0.34,9165,ULTRA BEVERAGE COMPANY LLP
411081,46_TYWARDREATH_10227,46,10227,Due Torri Pnt Nr del Venezie,750mL,2,19.98,9.99,1/23/2016,750,2,0.22,9165,ULTRA BEVERAGE COMPANY LLP
411082,46_TYWARDREATH_1023,46,1023,Hennessy VSOP Cognac + 50mL,750mL,1,51.99,51.99,1/25/2016,750,1,0.79,8112,MOET HENNESSY USA INC
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
416351,46_TYWARDREATH_981,46,981,McCormick Triple Sec,Liter,1,3.99,3.99,1/22/2016,1000,1,1.05,5992,MCCORMICK DISTILLING CO
416352,46_TYWARDREATH_981,46,981,McCormick Triple Sec,Liter,1,3.99,3.99,1/25/2016,1000,1,1.05,5992,MCCORMICK DISTILLING CO
416353,46_TYWARDREATH_981,46,981,McCormick Triple Sec,Liter,1,3.99,3.99,1/29/2016,1000,1,1.05,5992,MCCORMICK DISTILLING CO
416354,46_TYWARDREATH_984,46,984,Patron XO Cafe Liqueur,750mL,1,26.99,26.99,1/15/2016,750,1,0.79,9165,ULTRA BEVERAGE COMPANY LLP
416355,46_TYWARDREATH_984,46,984,Patron XO Cafe Liqueur,750mL,1,26.99,26.99,1/22/2016,750,1,0.79,9165,ULTRA BEVERAGE COMPANY LLP

no hay city para store 46 , y si hay ventas y compras. Averiguar la city para cargarlo a mano.

In [92]:
Stores.loc[Stores['Store'] == 46, 'City'] = 'TYWARDREATH'

In [94]:
Stores[Stores['Store'] == 46]

        Store         City
113895     46  TYWARDREATH

Exportar base a .csv para ser cargarse en SQL

In [95]:
Stores.to_csv('Stores.csv', index=False)

In [161]:
Stores[Stores['Store'] == 42]

        Store          City
104841     42  BLACK HOLLOW